PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_cmp.c
/*!
    \file    gd32f3x0_hal_cmp.c
    \brief   CMP driver

    \version 2023-08-01, V1.0.0, HAL firmware for GD32F3x0
*/

/*
    Copyright (c) 2023, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32f3x0_hal.h"


/*!
    \brief      initialize CMP
    \param[in]  cmp_dev: CMP device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_init: the pointer to CMP init structure
                  mode:
                  only one parameter can be selected which is shown as below:
      \arg          CMP_MODE_HIGHSPEED: high speed and power mode
      \arg          CMP_MODE_MIDDLESPEED: middle speed and power mode
      \arg          CMP_MODE_LOWSPEED: low speed and power mode
      \arg          CMP_MODE_VERYLOWSPEED: very low speed and power mode
                  polarity:
                  only one parameter can be selected which is shown as below:
      \arg          CMP_OUTPUT_POLARITY_NONINVERTED: CMP output not inverted
      \arg          CMP_OUTPUT_POLARITY_INVERTED: CMP output inverted
                  hysteresis:
                  only one parameter can be selected which is shown as below:
      \arg          CMP_HYSTERESIS_NO: input no hysteresis
      \arg          CMP_HYSTERESIS_LOW: input hysteresis level low
      \arg          CMP_HYSTERESIS_MIDDLE: input hysteresis level middle
      \arg          CMP_HYSTERESIS_HIGH: input hysteresis level high
                  inverting_input:
                  only one parameter can be selected which is shown as below:
      \arg          CMP_INVERTING_INPUT_1_4VREFINT: inverting input 1/4 Vrefint
      \arg          CMP_INVERTING_INPUT_1_2VREFINT: inverting input 1/2 Vrefint
      \arg          CMP_INVERTING_INPUT_3_4VREFINT: inverting input 3/4 Vrefint
      \arg          CMP_INVERTING_INPUT_VREFINT: inverting input Vrefint
      \arg          CMP_INVERTING_INPUT_PA4: inverting input PA4(DAC0_OUT0)
      \arg          CMP_INVERTING_INPUT_PA5: inverting input PA5
      \arg          CMP_INVERTING_INPUT_PA0_PA2: inverting input PA0 for CMP0 or PA2 for CMP1
                  noninverting_input:
                    the argument could be selected from enumeration <hal_cmp_noninverting_input_enum>
                  outputsel:
                  only one parameter can be selected which is shown as below:
      \arg          CMP_OUTPUT_NONE: output none
      \arg          CMP_OUTPUT_TIMER0_BKIN: output TIMER0 break input
      \arg          CMP_OUTPUT_TIMER0_IC0: output TIMER0_CH0 input capture
      \arg          CMP_OUTPUT_TIMER0_OCPRECLR: output TIMER0 OCPRE_CLR input
      \arg          CMP_OUTPUT_TIMER1_IC3: output TIMER1_CH3 input capture
      \arg          CMP_OUTPUT_TIMER1_OCPRECLR: output TIMER1 OCPRE_CLR input
      \arg          CMP_OUTPUT_TIMER2_IC0: output TIMER2_CH0 input capture
      \arg          CMP_OUTPUT_TIMER2_OCPRECLR: output TIMER2 OCPRE_CLR input
                  exti_type:
                    the argument could be selected from enumeration <hal_cmp_exti_type_enum>
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_LOCK, details refer to gd32f3x0_hal.h
*/
int32_t hal_cmp_init(hal_cmp_dev_struct *cmp_dev, uint32_t periph, hal_cmp_init_struct *p_init)
{
    uint32_t temp_val;
    uint32_t bit_shift;

#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == cmp_dev) || (NULL == p_init)) {
        HAL_DEBUGE("pointer address is invalid");
        return HAL_ERR_ADDRESS;
    }
    if(!IS_CMP_PERIPHERAL(cmp_dev->periph)) {
        HAL_DEBUGE("CMP peripheral is invalid");
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* initialize mutex to unlocked  */
    cmp_dev->mutex = HAL_MUTEX_UNLOCKED;

    /* initialize cmp_dev periph */
    cmp_dev->periph = periph;

    /* initialize the CMP */
    if(HAL_CMP_STATE_RESET == cmp_dev->state) {
        /* calculate bit shift of CMP0 or CMP1 */
        if(CMP0 == cmp_dev->periph) {
            bit_shift = 0U;
        } else {
            bit_shift = 16U;
        }

        /* check if CMP locked */
        if(CMP_CS & (CMP_CS_CMP0LK << bit_shift)) {
            return HAL_ERR_LOCK;
        }

        /* clear bits */
        temp_val = CMP_CS;
        temp_val &= ~((uint32_t)0x0000FFFFU << bit_shift);

        /* configure the operating mode, output selection, inverting_input and hysteresis */
        temp_val |= (uint32_t)(p_init->mode | \
                               p_init->inverting_input | \
                               p_init->outputsel | \
                               p_init->hysteresis) << bit_shift;

        /* configure the output polarity */
        if(CMP_OUTPUT_POLARITY_INVERTED == p_init->polarity) {
            temp_val |= (uint32_t)CMP_CS_CMP0PL << bit_shift;
        } else {
            temp_val &= ~((uint32_t)CMP_CS_CMP0PL << bit_shift);
        }

