PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_cmp.c
        /* configure the noninverting input port */
        if(CMP0 == cmp_dev->periph) {
            if(CMP0_IP_PA1 == p_init->noninverting_input) {
                /* disable switch close */
                temp_val &= ~CMP_CS_CMP0SW;
            } else if(CMP0_IP_PA4_SWCLOSE == p_init->noninverting_input) {
                /* enable switch close */
                temp_val |= CMP_CS_CMP0SW;
            } else {
            }
        } else {
            if(CMP1_IP_PA3 == p_init->noninverting_input) {
                /* disable window mode */
                temp_val &= ~CMP_CS_WNDEN;
            } else if(CMP1_IP_OF_CMP0 == p_init->noninverting_input) {
                /* enable window mode */
                temp_val |= CMP_CS_WNDEN;
            } else {
            }
        }

        /* write register */
        CMP_CS = temp_val;

        /* configure EXTI type: falling, rising or both */
        if(CMP0 == cmp_dev->periph) {
            hal_exti_internal_init((hal_exti_internal_line_enum)EXTI_CMP_OUTPUT_21, (hal_exti_type_enum)p_init->exti_type);
            /* disable CMP EXTI interrupt until calling hal_cmp_start_interrupt */
            EXTI_INTEN &= ~EXTI_CMP_OUTPUT_21;
        } else {
            hal_exti_internal_init((hal_exti_internal_line_enum)EXTI_CMP_OUTPUT_22, (hal_exti_type_enum)p_init->exti_type);
            /* disable CMP EXTI interrupt until calling hal_cmp_start_interrupt */
            EXTI_INTEN &= ~EXTI_CMP_OUTPUT_22;
        }

        /* change CMP state */
        cmp_dev->state = HAL_CMP_STATE_READY;
    }

    return HAL_ERR_NONE;
}

/*!
    \brief      initialize the CMP structure with the default values
    \param[in]  hal_struct_type: the type of the structure
    \param[in]  p_struct: the pointer of the structure
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL,
                details refer to gd32f3x0_hal.h
*/
int32_t hal_cmp_struct_init(hal_cmp_struct_type_enum hal_struct_type, void *p_struct)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == p_struct) {
        HAL_DEBUGE("pointer address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    switch(hal_struct_type) {
    case HAL_CMP_INIT_STRUCT:
        /* initialize CMP initialization structure with the default values */
        ((hal_cmp_init_struct *)p_struct)->noninverting_input = CMP0_IP_PA1;
        ((hal_cmp_init_struct *)p_struct)->inverting_input   = CMP_INVERTING_INPUT_1_4VREFINT;
        ((hal_cmp_init_struct *)p_struct)->mode              = CMP_MODE_HIGHSPEED;
        ((hal_cmp_init_struct *)p_struct)->hysteresis        = CMP_HYSTERESIS_NO;
        ((hal_cmp_init_struct *)p_struct)->outputsel         = CMP_OUTPUT_NONE;
        ((hal_cmp_init_struct *)p_struct)->polarity          = CMP_OUTPUT_POLARITY_NONINVERTED;
        break;

    case HAL_CMP_DEV_STRUCT:
        /* initialize CMP device information structure with the default values */
        ((hal_cmp_dev_struct *)p_struct)->periph             = CMP0;
        ((hal_cmp_dev_struct *)p_struct)->state              = HAL_CMP_STATE_RESET;
        ((hal_cmp_dev_struct *)p_struct)->output_level       = CMP_OUTPUTLEVEL_LOW;
        ((hal_cmp_dev_struct *)p_struct)->cmp_irq.output_changed_handle = NULL;
        break;
    default:
        HAL_DEBUGW("parameter [hal_struct_type] value is undefine");
        return HAL_ERR_VAL;
    }

    return HAL_ERR_NONE;
}

/*!
    \brief      deinitialize CMP
    \param[in]  cmp_dev: CMP device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_LOCK,
                details refer to gd32f3x0_hal.h
*/
int32_t hal_cmp_deinit(hal_cmp_dev_struct *cmp_dev)
{
    uint32_t bit_shift;
    int32_t tmp_hal_err = HAL_ERR_NONE;

#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == cmp_dev) {
        HAL_DEBUGE("pointer [cmp_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
    if(!IS_CMP_PERIPHERAL(cmp_dev->periph)) {
        HAL_DEBUGE("CMP peripheral is invalid");
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    /* change CMP state */
    cmp_dev->state = HAL_CMP_STATE_BUSY;

    /* calculate bit shift of CMP0 or CMP1 */
    if(CMP0 == cmp_dev->periph) {
        bit_shift = 0U;
    } else {
        bit_shift = 16U;
    }

    /* deinitialize the CMP */
    /* check if CMP locked */
    if(CMP_CS & (CMP_CS_CMP0LK << bit_shift)) {
        tmp_hal_err = HAL_ERR_LOCK;
        /* change CMP state */
        cmp_dev->state = HAL_CMP_STATE_READY;
    } else {
        /* deinitialize CMP register */
        CMP_CS &= ~((uint32_t)0x0000FFFFU << bit_shift);
        /* change CMP state */
        cmp_dev->state = HAL_CMP_STATE_RESET;
    }

    /* deinit EXTI type: falling, rising or both */
    if(CMP0 == cmp_dev->periph) {
        hal_exti_internal_deinit((hal_exti_internal_line_enum)EXTI_CMP_OUTPUT_21);
    } else {
        hal_exti_internal_deinit((hal_exti_internal_line_enum)EXTI_CMP_OUTPUT_22);
    }

    /* release lock */
    HAL_UNLOCK(cmp_dev);

    return tmp_hal_err;
}

/*!
    \brief      start CMP module function
    \param[in]  cmp_dev: CMP device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_LOCK,
                details refer to gd32f3x0_hal.h
*/
int32_t hal_cmp_start(hal_cmp_dev_struct *cmp_dev)
{
    uint32_t bit_shift;
    int32_t tmp_hal_err = HAL_ERR_NONE;

#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == cmp_dev) {
        HAL_DEBUGE("pointer [cmp_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
    if(!IS_CMP_PERIPHERAL(cmp_dev->periph)) {
        HAL_DEBUGE("CMP peripheral is invalid");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* process locked */
    HAL_LOCK(cmp_dev);

    /* change CMP state */
    cmp_dev->state = HAL_CMP_STATE_BUSY;

    /* calculate bit shift of CMP0 or CMP1 */
    if(CMP0 == cmp_dev->periph) {
        bit_shift = 0U;
    } else {
        bit_shift = 16U;
    }

    /* check if CMP locked */
    if(CMP_CS & (CMP_CS_CMP0LK << bit_shift)) {
        tmp_hal_err = HAL_ERR_LOCK;
    } else {
        /* enable CMP module */
        CMP_CS |= CMP_CS_CMP0EN << bit_shift;
    }

    /* change CMP state */
    cmp_dev->state = HAL_CMP_STATE_READY;

