PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_cmp.c
    /* process unlocked */
    HAL_UNLOCK(cmp_dev);

    return tmp_hal_err;
}

/*!
    \brief      stop cmp module function
    \param[in]  cmp_dev: CMP device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_LOCK,
                details refer to gd32f3x0_hal.h
*/
int32_t hal_cmp_stop(hal_cmp_dev_struct *cmp_dev)
{
    uint32_t bit_shift;
    int32_t tmp_hal_err = HAL_ERR_NONE;

#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == cmp_dev) {
        HAL_DEBUGE("pointer [cmp_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
    if(!IS_CMP_PERIPHERAL(cmp_dev->periph)) {
        HAL_DEBUGE("CMP peripheral is invalid");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    /* calculate bit shift of CMP0 or CMP1 */
    if(CMP0 == cmp_dev->periph) {
        bit_shift = 0U;
    } else {
        bit_shift = 16U;
    }

    /* check if CMP locked */
    if(CMP_CS & (CMP_CS_CMP0LK << bit_shift)) {
        tmp_hal_err = HAL_ERR_LOCK;
    } else {
        /* disable CMP module */
        CMP_CS &= ~(CMP_CS_CMP0EN << bit_shift);
    }

    /* change CMP state */
    cmp_dev->state = HAL_CMP_STATE_READY;

    return tmp_hal_err;
}

/*!
    \brief      start CMP module function in interrupt mode
    \param[in]  cmp_dev: CMP device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_LOCK,
                details refer to gd32f3x0_hal.h
*/
int32_t hal_cmp_start_interrupt(hal_cmp_dev_struct *cmp_dev, hal_cmp_irq_struct *p_irq)
{
    uint32_t bit_shift;
    int32_t tmp_hal_err = HAL_ERR_NONE;

#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == cmp_dev) || (NULL == p_irq)) {
        HAL_DEBUGE("pointer [cmp_dev] or pointer [p_irq] address is invalid");
        return HAL_ERR_ADDRESS;
    }
    if(!IS_CMP_PERIPHERAL(cmp_dev->periph)) {
        HAL_DEBUGE("CMP peripheral is invalid");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* process locked */
    HAL_LOCK(cmp_dev);

    /* change CMP state */
    cmp_dev->state = HAL_CMP_STATE_BUSY;

    /* configure interrupt callback function */
    cmp_dev->cmp_irq.output_changed_handle = p_irq->output_changed_handle;

    /* start cmp module */
    /* calculate bit shift of CMP0 or CMP1 */
    if(CMP0 == cmp_dev->periph) {
        bit_shift = 0U;
    } else {
        bit_shift = 16U;
    }

    /* check if CMP locked */
    if(CMP_CS & (CMP_CS_CMP0LK << bit_shift)) {
        tmp_hal_err = HAL_ERR_LOCK;
    } else {
        /* enable CMP module */
        CMP_CS |= CMP_CS_CMP0EN << bit_shift;
    }

    /* enable CMP EXTI line interrupt */
    /* configure EXTI trigger type: falling, rising or both edge */
    if(CMP0 == cmp_dev->periph) {
        /* clear CMP EXTI interrupt flag */
        hals_exti_interrupt_flag_clear(EXTI_CMP_OUTPUT_21);
        EXTI_INTEN |= EXTI_CMP_OUTPUT_21;
    } else {
        /* clear CMP EXTI interrupt flag */
        hals_exti_interrupt_flag_clear(EXTI_CMP_OUTPUT_22);
        EXTI_INTEN |= EXTI_CMP_OUTPUT_22;
    }

    /* change CMP state */
    cmp_dev->state = HAL_CMP_STATE_READY;

    /* process unlocked */
    HAL_UNLOCK(cmp_dev);

    return tmp_hal_err;
}

/*!
    \brief      stop CMP module function in interrupt mode
    \param[in]  cmp_dev: CMP device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_LOCK, HAL_ERR_VAL,
                details refer to gd32f3x0_hal.h
*/
int32_t hal_cmp_stop_interrupt(hal_cmp_dev_struct *cmp_dev)
{
    uint32_t bit_shift;
    int32_t tmp_hal_err = HAL_ERR_NONE;

#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == cmp_dev) {
        HAL_DEBUGE("pointer [cmp_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
    if(!IS_CMP_PERIPHERAL(cmp_dev->periph)) {
        HAL_DEBUGE("CMP peripheral is invalid");
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* reset interrupt callback function */
    cmp_dev->cmp_irq.output_changed_handle = NULL;

    /* stop cmp module */
    /* calculate bit shift of CMP0 or CMP1 */
    if(CMP0 == cmp_dev->periph) {
        bit_shift = 0U;
    } else {
        bit_shift = 16U;
    }

    /* check if CMP locked */
    if(CMP_CS & (CMP_CS_CMP0LK << bit_shift)) {
        tmp_hal_err = HAL_ERR_LOCK;
    } else {
        /* disable CMP module */
        CMP_CS &= ~(CMP_CS_CMP0EN << bit_shift);
    }

    /* disable CMP EXTI interrupt */
    /* configure EXTI trigger type: falling, rising or both edge */
    if(CMP0 == cmp_dev->periph) {
        /* disable CMP EXTI interrupt */
        EXTI_INTEN &= ~EXTI_CMP_OUTPUT_21;
    } else {
        /* disable CMP EXTI interrupt */
        EXTI_INTEN &= ~EXTI_CMP_OUTPUT_22;
    }

    return tmp_hal_err;
}

/*!
    \brief      set the CMP external trigger interrupt callback function,
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  cmp_dev: CMP device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_irq: point to ADC interrupt callback functions structure
      \arg        hal_irq_handle_cb function pointer: the function is user-defined,
                    the corresponding callback mechanism is in use, and enable corresponding interrupt
      \arg        NULL: The corresponding callback mechanism is out of use, and
                    disable corresponding interrupt
    \param[out] none
    \retval     none
*/
void hal_cmp_irq_handle_set(hal_cmp_dev_struct *cmp_dev, hal_cmp_irq_struct *p_irq)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == cmp_dev) || (NULL == p_irq)) {
        HAL_DEBUGE("pointer [cmp_dev] or pointer [p_irq] address is invalid");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

