PeterLFoy/GigaDevice-EmbeddedBuilder/WorkspaceF310/SimpleADC_DMA/firmware/gd32f3x0_hal_peripheral/Source/gd32f3x0_hal_cmp.c
    /* CMP output changed interrupt handler set */
    if(NULL != p_irq->output_changed_handle) {
        cmp_dev->cmp_irq.output_changed_handle = p_irq->output_changed_handle;
        /* enable CMP EXTI interrupt */
        if(CMP0 == cmp_dev->periph) {
            /* enable CMP EXTI interrupt */
            EXTI_INTEN |= EXTI_CMP_OUTPUT_21;
        } else {
            /* enable CMP EXTI interrupt */
            EXTI_INTEN |= EXTI_CMP_OUTPUT_22;
        }
    } else {
        cmp_dev->cmp_irq.output_changed_handle = NULL;
        /* disable CMP EXTI interrupt */
        if(CMP0 == cmp_dev->periph) {
            /* disable CMP EXTI interrupt */
            EXTI_INTEN &= ~EXTI_CMP_OUTPUT_21;
        } else {
            /* disable CMP EXTI interrupt */
            EXTI_INTEN &= ~EXTI_CMP_OUTPUT_22;
        }
    }
}

/*!
    \brief      reset the CMP external trigger interrupt callback function,
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  cmp_dev: CMP device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_cmp_irq_handle_all_reset(hal_cmp_dev_struct *cmp_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == cmp_dev) {
        HAL_DEBUGE("pointer [cmp_dev] address is invalid");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    /* reset interrupt callback function */
    cmp_dev->cmp_irq.output_changed_handle = NULL;
}

/*!
    \brief      CMP interrupt handler content function,
                which is merely used in EXTI_IRQHandler
    \param[in]  cmp_dev: CMP device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_cmp_irq(hal_cmp_dev_struct *cmp_dev)
{
    hal_exti_line_enum linex;
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == cmp_dev) {
        HAL_DEBUGE("pointer [cmp_dev] address is invalid");
    }
    if(!IS_CMP_PERIPHERAL(cmp_dev->periph)) {
        HAL_DEBUGE("CMP peripheral is invalid");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    if(CMP0 == cmp_dev->periph) {
        linex = EXTI_CMP_OUTPUT_21;
    } else {
        linex = EXTI_CMP_OUTPUT_22;
    }

    /* check EXTI interrupt flag */
    if(SET == hals_exti_interrupt_flag_get(linex)) {
        hals_exti_interrupt_flag_clear(linex);

        if(NULL != cmp_dev->cmp_irq.output_changed_handle) {
            cmp_dev->cmp_irq.output_changed_handle(cmp_dev);
        }
    }
}

/*!
    \brief      lock the CMP
    \note       the register is read only if locked, and only can be unlocked by MCU reset
    \param[in]  cmp_dev: CMP device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_ALREADY_DONE, HAL_ERR_VAL
                details refer to gd32f3x0_hal.h
*/
int32_t hal_cmp_lock(hal_cmp_dev_struct *cmp_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == cmp_dev) {
        HAL_DEBUGE("pointer [cmp_dev] address is invalid");
        /* return function state */
        return HAL_ERR_ADDRESS;
    }
    if(!IS_CMP_PERIPHERAL(cmp_dev->periph)) {
        HAL_DEBUGE("CMP peripheral is invalid");
        /* return function state */
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    if(CMP0 == cmp_dev->periph) {
        /* check if aready locked */
        if(CMP_CS & CMP_CS_CMP0LK) {
            return HAL_ERR_ALREADY_DONE;
        }

        /* lock CMP0 */
        CMP_CS |= (uint32_t)CMP_CS_CMP0LK;
    } else {
        /* check if aready locked */
        if(CMP_CS & CMP_CS_CMP1LK) {
            return HAL_ERR_ALREADY_DONE;
        }
        /* lock CMP1 */
        CMP_CS |= (uint32_t)CMP_CS_CMP1LK;
    }

    return HAL_ERR_NONE;
}

/*!
    \brief      get output level of CMP
    \param[in]  cmp_dev: CMP device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     the output level
*/
uint32_t hal_cmp_output_level_get(hal_cmp_dev_struct *cmp_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == cmp_dev) {
        HAL_DEBUGE("pointer [cmp_dev] address is invalid");
    }
    if(!IS_CMP_PERIPHERAL(cmp_dev->periph)) {
        HAL_DEBUGE("CMP peripheral is invalid");
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    if(CMP0 == cmp_dev->periph) {
        /* get output level of CMP0 */
        cmp_dev->output_level = (CMP_CS & CMP_CS_CMP0O) ? CMP_OUTPUTLEVEL_HIGH : CMP_OUTPUTLEVEL_LOW;
    } else {
        /* get output level of CMP1 */
        cmp_dev->output_level = (CMP_CS & CMP_CS_CMP1O) ? CMP_OUTPUTLEVEL_HIGH : CMP_OUTPUTLEVEL_LOW;
    }

    return cmp_dev->output_level;
}

/*!
    \brief      get the state of CMP device
    \param[in]  cmp_dev: CMP device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     hal_cmp_state_enum: HAL_CMP_STATE_NONE, HAL_CMP_STATE_RESET, HAL_CMP_STATE_BUSY, HAL_CMP_STATE_READY,
                                    HAL_CMP_STATE_TIMEOUT, HAL_CMP_STATE_ERROR
*/
hal_cmp_state_enum hal_cmp_state_get(hal_cmp_dev_struct *cmp_dev)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == cmp_dev) {
        HAL_DEBUGE("pointer [cmp_dev] address is invalid");
        return HAL_CMP_STATE_NONE;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */

    return cmp_dev->state;
}
